CREATE TABLE IF NOT EXISTS `indexes`(    
    id INTEGER AUTO_INCREMENT,
    name VARCHAR(300),
    indexTableId INTEGER,
    createdAt VARCHAR(100),
    updatedAt VARCHAR(100),
    PRIMARY KEY (id)
)ENGINE=InnoDB;

INSERT INTO indexes VALUES 
(1,'Ποσοστό αποφοίτων γ ́βαθμιας εκπαίδευσης που βρίσκουν εργασία στον τομέα των σπουδών τους εντός 6 μηνών από την έναρξη αναζήτησης',1,NOW(), NOW()),
(2,'Αριθμός πιστοποιημένων Πανεπιστημιακών σχολών (ISO κλπ)',1,NOW(), NOW()),
(3,'Αριθμός συμμετοχών σε προγράμματα Έρευνας, Τεχνολογίας & Καινοτομίας (διεθνή & εθνικά), ανά Πανεπιστημιακή Σχολή',1,NOW(), NOW()),
(4,'Αριθμός έργων/μελετών που έχουν ανατεθεί από τον ιδιωτικό τομέα, ανά Πανεπιστημιακή / Τεχνολογική Σχολή',1,NOW(), NOW()),
(5,'Δαπάνη ανά φοιτητή τριτοβάθμιας εκπαίδευσης ανά ΑΕΙ	',1,NOW(), NOW()),
(6,'Ποσοστό ενηλίκων (στο σύνολο του ενεργού πληθυσμού) που συμμετέχουν σε προγράμματα δια βίου εκπαίδευσης',1,NOW(), NOW()),
(7,'Ποσοστό αναλφάβητων/σύνολο πληθυσμού',1,NOW(), NOW()),
(8,'Αριθμός ατόμων που εγκαταλείπουν το σχολείο πριν την ολοκλήρωση της β’ βάθμιας και α’ βάθμιας εκπαίδευσης / έτος',1,NOW(), NOW()),
(9,'Αριθμός δια-πολιτισμικών σχολείων ανά Περιφέρεια (ποσοστό μαθητών στο σύνολο των μαθητών) που φοιτούν σε διαπολιτισμικά σχολεία',1,NOW(), NOW()),
(10,'Ποσοστό αλλοδαπών μαθητών στο σύνολο (των μαθητών) – Κατανομή ανά περιφέρεια',1,NOW(), NOW()),
(11,'Αριθμός ολοήμερων / απογευματινών σχολείων και αριθμός μαθητών που φοιτούν σε αυτά',1,NOW(), NOW()),
(12,'Μέσος όρος καθηγητών / σύνολο μαθητών',1,NOW(), NOW()),
(13,'Μέσος όρος Η/Υ / σύνολο μαθητών',1,NOW(), NOW()),
(14,'Αριθμός μαθητών που επωφελούνται από προγράμματα ενισχυτικής εκπαίδευσης / έτος',1,NOW(), NOW()),
(15,'Δαπάνη ανά μαθητή ανά βαθμίδα (Αθμια, Βθμια) εκπαίδευσης',1,NOW(), NOW()),
(16,'Πραγματοποιηθείσες ανασκαφές, κατά είδος και αποτελέσματα, και αριθμός ευρημάτων',2,NOW(), NOW()),
(17,'Χρηματοδοτήσεις ανασκαφών, κατά φορέα, και ποσά που διατέθηκαν',2,NOW(), NOW()),
(18,'Χρηματοδοτήσεις ανασκαφών, κατά φορέα, και ποσά που διατέθηκαν',2,NOW(), NOW()),
(19,'Κήρυξη αρχαιολογικών χώρων, μνημείων, παραδοσιακών και ιστορικών οικισμών',2,NOW(), NOW()),
(20,'Πραγματοποιηθείσες απαλλοτριώσεις και καταβληθείσες αποζημιώσεις, για ακίνητα αρχαιολογικού ενδιαφέροντος',2,NOW(), NOW()),
(21,'Δαπάνες έργων που έχουν εκτελεσθεί σε μνημεία και αρχαιολογικούς χώρους, και δαπάνες έργων που βρίσκονται σε εξέλιξη',2,NOW(), NOW()),
(22,'Δαπάνες έργων που έχουν εκτελεσθεί σε μουσεία και λοιπά κτίρια και δαπάνες έργων που βρίσκονται σε εξέλιξη',2,NOW(), NOW()),
(23,'Αριθμός βιβλιοθηκών κατά νομική μορφή και είδος βιβλιοθήκης, ανάλογα με το θέμα, κατά γεωγραφικό διαμέρισμα',2,NOW(), NOW());

