const validations = {
//   main_validations: {
    // title: () => {},
    agency: () => {
      if ($("#epispeudon_foreas").val() === "") {
        return "Ο επισπεύδων φορέας είναι υποχρεωτικός";
      }
    },
    field_1: () => {
      if ($("#field_1").val() === "") {
        return "Το πεδίο 1 είναι υποχρεωτικό";
      }
    },
    field_2: () => {
      if ($("#field_2").val() === "") {
        return "Το πεδίο 2 είναι υποχρεωτικό";
      }
    },
    field_3: () => {
      if ($("#field_3").val() === "") {
        return "Το πεδίο 3 είναι υποχρεωτικό";
      }
    },
    field_4: () => {
      if (
        $("#field_4_1").val() === "" &&
        $("#field_4").val() !== "Όχι"
      ) {
        return "Το πεδίο 4 είναι υποχρεωτικό";
      }
    },
    field_5: () => {
      if (
        $("#field_5_1").val() === "" ||
        $("#field_5_2").val() === "" ||
        $("#field_5_3").val() === ""
      ) {
        return "Το πεδίο 5 είναι υποχρεωτικό";
      }
    },
    field_6: () => {
      if (
        ($("#field_6_1").val() === "" ||
          $("#field_6_2").val() === "" ||
          $("#field_6_3").val() === "") &&
        $("#field_6").val() !== "Όχι"
      ) {
        return "Το πεδίο 6 είναι υποχρεωτικό";
      }
    },
    // field_7: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    field_8: () => {
      if (
        $("#field_8_1").val() === "" ||
          $("#field_8_2").val() === "" 
      ) {
        return "Το πεδίο 8 είναι υποχρεωτικό";
      }
    },
    // field_9: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    // field_10: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    // field_11: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    // field_12: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    // field_13: () => {
    //   if ($("#field_1").val() === "") {
    //     return "Το πεδίο 1 είναι υποχρεωτικό";
    //   }
    // },
    field_14: () => {
      if ($("#field_1").val() === "") {
        return "Το πεδίο 1 είναι υποχρεωτικό";
      }
    },
//   },
};